In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
data = [1,2,3,4,5]

In [5]:
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [6]:
data2 = [['vilas' , 28], ['sagar', 27], ['kishor', 31]]

In [7]:
pd.DataFrame(data2)

        0   1
0   vilas  28
1   sagar  27
2  kishor  31

In [9]:
df1= pd.DataFrame(data2, columns= ['Name', 'Age'])
df1

     Name  Age
0   vilas   28
1   sagar   27
2  kishor   31

In [10]:
# DF with Dictonary 
data3 = {'Name': ['vilas', 'sagar', 'kishor'], 'Age': [28, 29, 30]}

In [11]:
df3 = pd.DataFrame(data3)
df3

     Name  Age
0   vilas   28
1   sagar   29
2  kishor   30

In [12]:
data4 = [{'col1': 28, 'col2': 58}, {'col1': 82, 'col2': 54, 'col3': 77}]

In [14]:
df4  = pd.DataFrame(data4)
df4

   col1  col2  col3
0    28    58   NaN
1    82    54  77.0

In [15]:
# indexing 
df3 = pd.DataFrame(data3, index=['first', 'sec', 'third'])
df3

         Name  Age
first   vilas   28
sec     sagar   29
third  kishor   30

In [29]:
# creating JSON data

data5 = '''{
"name": "vilas",
"phone": 5488,
"comp": ["abc","def"]}'''

In [30]:
data5

'{\n"name": "vilas",\n"phone": 5488,\n"comp": ["abc","def"]}'

In [33]:
import json
df5 = json.loads(data5)
df5

{'name': 'vilas', 'phone': 5488, 'comp': ['abc', 'def']}

In [34]:
pd.DataFrame(df5)

    name  phone comp
0  vilas   5488  abc
1  vilas   5488  def

In [35]:
df5

{'name': 'vilas', 'phone': 5488, 'comp': ['abc', 'def']}

In [36]:
df4

   col1  col2  col3
0    28    58   NaN
1    82    54  77.0

In [37]:
df4.sample()

   col1  col2  col3
1    82    54  77.0

In [38]:
#Row * Columns
df4.size

6

In [39]:
df4.axes

[RangeIndex(start=0, stop=2, step=1),
 Index(['col1', 'col2', 'col3'], dtype='object')]

In [40]:
df4.T

         0     1
col1  28.0  82.0
col2  58.0  54.0
col3   NaN  77.0

In [41]:
import numpy as np

In [50]:
df6 = pd.DataFrame(np.random.randn(5,3), columns= ['cl1','cl2','cl3'])

In [51]:
df6

        cl1       cl2       cl3
0 -0.638365  0.517282 -0.633220
1  0.061958 -0.606009  1.051980
2 -0.442166  0.913219  0.592360
3  0.653986 -0.346847 -0.036511
4  0.047699 -0.528463  1.838160

In [52]:
#use of apply fun
#df6.cl1.apply(
#    func: 'AggFuncType',
#    convert_dtype: 'bool' = True,
#    args: 'tuple[Any, ...]' = (),
#    **kwargs,
#)

df6.apply(np.mean)

cl1   -0.063378
cl2   -0.010164
cl3    0.562554
dtype: float64

In [53]:
df6.apply(lambda x : x.max())

cl1    0.653986
cl2    0.913219
cl3    1.838160
dtype: float64

In [55]:
df6.apply(lambda x : x.min())

cl1   -0.638365
cl2   -0.606009
cl3   -0.633220
dtype: float64

In [54]:
df6.apply(lambda x : x.max()- x.min())

cl1    1.292350
cl2    1.519228
cl3    2.471380
dtype: float64

In [56]:
# applying lambda fun no single clnm
df6.cl1.apply(lambda x : x**2)

0    0.407509
1    0.003839
2    0.195511
3    0.427697
4    0.002275
Name: cl1, dtype: float64

In [57]:
df6.cl1.map(lambda x : x *100)

0   -63.836470
1     6.195813
2   -44.216649
3    65.398560
4     4.769907
Name: cl1, dtype: float64

In [67]:
#
df6.set_index( ['cl1'])

                cl2       cl3
cl1
-0.638365  0.517282 -0.633220
 0.061958 -0.606009  1.051980
-0.442166  0.913219  0.592360
 0.653986 -0.346847 -0.036511
 0.047699 -0.528463  1.838160

In [59]:
df6

        cl1       cl2       cl3
0 -0.638365  0.517282 -0.633220
1  0.061958 -0.606009  1.051980
2 -0.442166  0.913219  0.592360
3  0.653986 -0.346847 -0.036511
4  0.047699 -0.528463  1.838160

In [70]:
# day 2
tech = {
    'courses' : ['Spark', 'Pyspark','hasoop', 'Pandas'],
    'fees': ['22000', '25000', '24000', '26000'],
    'Duration': ['30days', '50days', '40days', '60days'],
    'Discount': ['1000', '2300', '2500', '1400']
}

In [71]:
tech

{'courses': ['Spark', 'Pyspark', 'hasoop', 'Pandas'],
 'fees': ['22000', '25000', '24000', '26000'],
 'Duration': ['30days', '50days', '40days', '60days'],
 'Discount': ['1000', '2300', '2500', '1400']}

In [74]:
df_tech  = pd.DataFrame(tech, index= ['r1', 'r2', 'r3', 'r4'])

In [75]:
df_tech

    courses   fees Duration Discount
r1    Spark  22000   30days     1000
r2  Pyspark  25000   50days     2300
r3   hasoop  24000   40days     2500
r4   Pandas  26000   60days     1400

In [76]:
df_t = df_tech.reindex(['r1', 'rnew', 'r3', 'r4'])
df_t

     courses   fees Duration Discount
r1     Spark  22000   30days     1000
rnew     NaN    NaN      NaN      NaN
r3    hasoop  24000   40days     2500
r4    Pandas  26000   60days     1400

In [77]:
df_t = df_tech.reindex(['r1', 'rnew', 'r3', 'r4'], fill_value= 'test')
df_t

     courses   fees Duration Discount
r1     Spark  22000   30days     1000
rnew    test   test     test     test
r3    hasoop  24000   40days     2500
r4    Pandas  26000   60days     1400

In [78]:
# slicing the data from DF
#loc(location)
#iloc(index location)

In [81]:
df = pd.DataFrame(np.random.randn(8,4), index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'],
                 columns= ['A', 'B', 'C', 'D'])

In [82]:
df

          A         B         C         D
a -2.062907  1.703417  1.985835  1.462819
b  0.421593 -0.213839  1.625841  0.035898
c -0.646471 -1.612326  0.162229  1.075885
d  0.594187 -0.139339 -0.499857  0.563754
e  0.277136 -1.014924 -1.546291 -0.441104
f -1.233853  0.191362 -0.857208 -1.060529
g -1.474623  1.124144  1.518789 -1.769552
h  0.704953 -1.177084 -1.343507 -0.405596

In [88]:
df.loc[:,['A', 'C']]

          A         C
a -2.062907  1.985835
b  0.421593  1.625841
c -0.646471  0.162229
d  0.594187 -0.499857
e  0.277136 -1.546291
f -1.233853 -0.857208
g -1.474623  1.518789
h  0.704953 -1.343507

In [89]:
df.loc['a':'e',['A', 'C']]

          A         C
a -2.062907  1.985835
b  0.421593  1.625841
c -0.646471  0.162229
d  0.594187 -0.499857
e  0.277136 -1.546291

In [90]:
df.loc[['a', 'h'],['A', 'C']]

          A         C
a -2.062907  1.985835
h  0.704953 -1.343507

In [93]:
df.loc[['a','b']] > 0

       A      B     C     D
a  False   True  True  True
b   True  False  True  True

In [94]:
# iloc[]

In [97]:
df.iloc[0:2,1:3]

          B         C
a  1.703417  1.985835
b -0.213839  1.625841

In [103]:
df.iloc[5:, 1:]

          B         C         D
f  0.191362 -0.857208 -1.060529
g  1.124144  1.518789 -1.769552
h -1.177084 -1.343507 -0.405596

In [104]:
df1

     Name  Age
0   vilas   28
1   sagar   27
2  kishor   31

In [106]:
df3

         Name  Age
first   vilas   28
sec     sagar   29
third  kishor   30

In [107]:
df4

   col1  col2  col3
0    28    58   NaN
1    82    54  77.0

In [111]:
# concatination

pd.concat([df3, df4], axis= 0)

         Name   Age  col1  col2  col3
first   vilas  28.0   NaN   NaN   NaN
sec     sagar  29.0   NaN   NaN   NaN
third  kishor  30.0   NaN   NaN   NaN
0         NaN   NaN  28.0  58.0   NaN
1         NaN   NaN  82.0  54.0  77.0